// Лаб работа 1
<?php
// Задания для обучению тому как используются переменные и как оперировать с различными типами данных
echo "Период отпусков закончился!\n";
$integir = 288;
$streng = "Все возвращаются на работу!";
echo $integir."\n".$streng."\n";
$niwtext = "В ".$integir." приблизительно ... ".$streng;
echo $niwtext;
echo "\n".(45+67);
echo "\n45+67";
echo "\nКнига \"Герой\" выйдет в октябре, этого года!";
// переменная для стеха
$stih = "
Белый голубь взмахнул крылом,
На ветру плывёт над нами.
В сердце весна, в глазах синь,
Любовь и счастье - в ней причина.
";
// вывод стеха
echo $stih;