<?php
{
    $a = 0;
    $b = 0;
    for ($i = 0; $i <= 5; $i++) {
    echo "Итерация номер ".$i." значение а = ".$a." ,значение b = ".$b."<br \>  ";
    $a += 10;
    $b += 5;
}
echo "<br />Конец цикла, и значение a = " . $a . ", а значение b = " . $b;
}
// while
echo "<br /><br />";
{
    $a = 0;
    $b = 0;
    $i = 0;
    while($i<=5){
        echo "Итерация номер ".$i." значение а = ".$a." ,значение b = ".$b."<br \>  ";
        $a += 10;
        $b += 5;
        $i++;
    }
    echo "<br />Конец цикла, и значение a = " . $a . ", а значение b = " . $b;
    
}
echo "<br /><br />";
// array
{
    $arr = [];
    $size = 15;
    for( $i = 0; $i <= $size; $i++ ){
        $arr[] = rand(0,100);
    }
    print_r( $arr );

}
